kunichiko/MimicX-firmware/platforms/esp32/main/main.c
// ===================================================================================
// main.c  (ESP32 / BLE-MIDI ⇄ I2C ブリッジ)
// ===================================================================================
// Project:  Mimic X (MimicX-firmware) — ESP32 無線アダプタ (ブリッジ MCU)
// Author:   Kunihiko Ohnaka (@kunichiko)
// ===================================================================================
//
// ESP32-WROOM-32 を標準 BLE-MIDI ペリフェラルとして動作させ、phone から届く
// MIDI/SysEx をそのまま I2C 経由で CH32 (デバイスエンジン, I2C スレーブ 0x33) へ
// 中継する「ブリッジ」。タイミングが厳しい GPIO 制御 (joystick / x68k / MD6B) は
// 全て CH32 側に任せ、ESP32 はトランスポート変換に徹する (protocol §2.5)。
//
//   phone --BLE-MIDI--> ESP32 --I2C(0x33)--> CH32 --GPIO--> ターゲット機
//   phone <--BLE-MIDI-- ESP32 <--I2C+INT---- CH32  (IDENTIFY_RSP / ACK / TARGET_RX 等)
//
// ESP32 が自分で応答するのは BRIDGE_IDENTIFY (0x0A→0x0B, §6.4.5) のみ。
// それ以外 (IDENTIFY / HEART_BEAT / SET_CONFIG / Note / CC ...) は全て CH32 へ転送。
//
// 構成:
//   main.c          : NVS / NimBLE host 起動、GAP、BLE⇄I2C 中継、BRIDGE_IDENTIFY 自答
//   ble_midi.c      : BLE-MIDI GATT サービス、パケット復元/分割
//   i2c_bridge.c    : I2C マスター (CH32 への write / INT 駆動 read)
//
// プロトコル仕様: MimicX-protocol §2.3 / §2.5 / §6.4.5 (v0.8.0)
// ===================================================================================
#include <string.h>
#include <stdbool.h>

#include "nvs_flash.h"
#include "esp_log.h"
#include "esp_mac.h"
#include "esp_timer.h"
#include "esp_system.h"
#include "esp_rom_sys.h"   // esp_rom_software_reset_system (§6.4.6)
// FORCE_DOWNLOAD_BOOT (§6.4.6)。C6 は LP_AON、それ以外は RTC_CNTL 配下。
#if defined(CONFIG_IDF_TARGET_ESP32C6)
#include "soc/lp_aon_reg.h"
#else
#include "soc/rtc_cntl_reg.h"
#endif

#include "nimble/nimble_port.h"
#include "nimble/nimble_port_freertos.h"
#include "host/ble_hs.h"
#include "host/util/util.h"
#include "services/gap/ble_svc_gap.h"
#include "services/gatt/ble_svc_gatt.h"

#include "host/ble_store.h"

#include "ble_midi.h"
#include "i2c_bridge.h"
#include "ch32_swd.h"
#include "ch32_ota.h"
#include "board_config.h"
#include "mimicx_version.h"

#if defined(BOARD_HAS_USB_MIDI)
#include "usb_midi_bridge.h"   // S3 のみ: USB-OTG による USB-MIDI トランスポート
#endif

#if defined(BOARD_HAS_ANTENNA_SWITCH)
#include "driver/gpio.h"
#endif

// NimBLE のボンド永続化ストア (NVS)。ESP-IDF が提供 (ヘッダが include パスに無いため
// 前方宣言する。ESP-IDF の NimBLE 例と同じ書き方)。
void ble_store_config_init(void);

static const char *TAG = "mimicx";
#define DEVICE_NAME "MimicX"

// ---------------------------------------------------------------------------
// プロトコル定数 (§6, CH32 と一致させること)
// ---------------------------------------------------------------------------
#define BRIDGE_PROTO_MAJOR  0
#define BRIDGE_PROTO_MINOR  9   // ブリッジが実装する phone 側プロトコル (0.9)。FW 版数とは独立
// ESP ブリッジの FW 版数は共有の単一ソース (common/mimicx_version.h) を参照する。
// IDENTIFY 応答 (§6) と起動バナーでアプリへ申告する値。CH32 / タグと必ず一致する。
#define BRIDGE_FW_MAJOR     MIMICX_VERSION_MAJOR
#define BRIDGE_FW_MINOR     MIMICX_VERSION_MINOR
#define BRIDGE_FW_PATCH     MIMICX_VERSION_PATCH

#define SYSEX_MFR_ID            0x7D
#define SYSEX_SUB_ID            0x01
#define CMD_DISCONNECT          0x09
#define CMD_ACK                 0x06
#define CMD_BRIDGE_IDENTIFY_REQ 0x0A
#define CMD_BRIDGE_IDENTIFY_RSP 0x0B
#define CMD_BRIDGE_REBOOT_BL    0x0C
#define CMD_RESET               0x7F

#define ACK_OK                  0x00   // §6 ACK status
#define ACK_INVALID_VALUE       0x03

// BRIDGE_REBOOT_BOOTLOADER のマジック "BOT" (§6.4.6)。誤動作で書き込み不能な状態に
// 落ちるのを防ぐため、一致しない限り再起動しない。
#define REBOOT_BL_MAGIC0        0x42
#define REBOOT_BL_MAGIC1        0x4F
#define REBOOT_BL_MAGIC2        0x54

#define TRANSPORT_USB           0x00   // §6.4.5 transport: 0x00=USB, 0x01=BLE
#define TRANSPORT_BLE           0x01

static uint8_t g_addr_type;
static volatile bool g_ble_connected = false;   // GAP 接続状態 (切断通知の判定用)
// 現在の GAP 接続ハンドル。ダウンロードモードへ落ちる前に明示切断するのに使う。
static volatile uint16_t s_conn_handle = BLE_HS_CONN_HANDLE_NONE;

static void start_advertising(void);

// ---------------------------------------------------------------------------
// ボード早期初期化: XIAO ESP32-C6 のアンテナ RF スイッチ設定 (§board_config.h)。
// オンボードセラミックアンテナを使うには GPIO3=Low (RF スイッチ給電) + GPIO14=Low
// (オンボード選択) を出力する。未設定だと BLE の電波が極端に弱くなるため、無線を
// 立ち上げる前 (app_main 冒頭) に行う。ESP32 DevKit では no-op。
// ---------------------------------------------------------------------------
static void board_early_init(void) {
#if defined(BOARD_HAS_ANTENNA_SWITCH)
    gpio_config_t io = {
        .pin_bit_mask = (1ULL << BOARD_ANT_RF_ENABLE_GPIO) | (1ULL << BOARD_ANT_SELECT_GPIO),
        .mode         = GPIO_MODE_OUTPUT,
        .pull_up_en   = GPIO_PULLUP_DISABLE,
        .pull_down_en = GPIO_PULLDOWN_DISABLE,
        .intr_type    = GPIO_INTR_DISABLE,
    };
    gpio_config(&io);
    gpio_set_level(BOARD_ANT_RF_ENABLE_GPIO, 0);   // RF スイッチに給電
    gpio_set_level(BOARD_ANT_SELECT_GPIO, 0);      // オンボードアンテナを選択
    ESP_LOGI(TAG, "XIAO C6 antenna: onboard (RF_EN=GPIO%d SEL=GPIO%d)",
             BOARD_ANT_RF_ENABLE_GPIO, BOARD_ANT_SELECT_GPIO);
#endif
}

// ---------------------------------------------------------------------------
// serial[16]: ESP32 base MAC (6 byte) を 8 byte に 0 埋めして 16 ASCII hex 化。
// これは「ブリッジの serial」(BLE 接続先の識別用)。デバイスの同一性は CH32 の
// IDENTIFY (Chip UID) を正とする (§6.4.5)。
// ---------------------------------------------------------------------------
static void build_serial16(char out[16]) {
    static const char hex[] = "0123456789ABCDEF";
    uint8_t mac[6] = {0};
    esp_read_mac(mac, ESP_MAC_BT);
    uint8_t bytes[8] = { 0, 0, mac[0], mac[1], mac[2], mac[3], mac[4], mac[5] };
    for (int i = 0; i < 8; i++) {
        out[i * 2]     = hex[bytes[i] >> 4];
        out[i * 2 + 1] = hex[bytes[i] & 0x0F];
    }
}

// ---------------------------------------------------------------------------
// BRIDGE_IDENTIFY_RESPONSE をブリッジ自身が組み立てて送信する (§6.4.5)。
// transport には要求が届いた経路 (TRANSPORT_BLE / TRANSPORT_USB) を申告し、
// send で同じ経路に返す。
// ---------------------------------------------------------------------------
static void send_bridge_identify_response(uint8_t transport,
                                          void (*send)(const uint8_t *msg, int n)) {
    uint8_t rsp[64];
    int i = 0;
    rsp[i++] = 0xF0;
    rsp[i++] = SYSEX_MFR_ID;
    rsp[i++] = SYSEX_SUB_ID;
    rsp[i++] = CMD_BRIDGE_IDENTIFY_RSP;
    rsp[i++] = BRIDGE_PROTO_MAJOR;
    rsp[i++] = BRIDGE_PROTO_MINOR;
    rsp[i++] = BRIDGE_FW_MAJOR;
    rsp[i++] = BRIDGE_FW_MINOR;
    rsp[i++] = BRIDGE_FW_PATCH;
    rsp[i++] = transport;
    char ser[16];
    build_serial16(ser);
    memcpy(&rsp[i], ser, 16);
    i += 16;
    static const char name[] = "MimicX-ESP32";
    for (int j = 0; name[j] && i < (int)sizeof(rsp) - 1; j++) {
        rsp[i++] = (uint8_t)(name[j] & 0x7F);
    }
    rsp[i++] = 0xF7;
    send(rsp, i);
}

// ---------------------------------------------------------------------------
// 中継: phone(BLE) → CH32(I2C)
//   BRIDGE_IDENTIFY のみブリッジが自答。それ以外は全て CH32 へ素通し。
// ---------------------------------------------------------------------------
static bool is_bridge_identify_req(const uint8_t *m, int n) {
    return n >= 5 && m[0] == 0xF0 && m[1] == SYSEX_MFR_ID &&
           m[2] == SYSEX_SUB_ID && m[3] == CMD_BRIDGE_IDENTIFY_REQ;
}

// ---------------------------------------------------------------------------
// BRIDGE_REBOOT_BOOTLOADER (0x0C, §6.4.6)
//
// FORCE_DOWNLOAD_BOOT を立ててリセットすると、次回起動時に ROM のダウンロード
// モードで立ち上がる (= BOOT ボタンを押しながら電源投入したのと同じ状態)。
// これで基板上の小さな BOOT ボタンを押さずに esptool / esptool-js から書き込める。
//
// 注意: ダウンロードモードに入ると MIDI デバイスとしては消える。通常動作に戻すには
// 電源再投入かファーム書き込みが必要 (§6.4.6)。マジック必須にしているのはこのため。
// ---------------------------------------------------------------------------
static bool is_bridge_reboot_bl_req(const uint8_t *m, int n) {
    return n >= 5 && m[0] == 0xF0 && m[1] == SYSEX_MFR_ID &&
           m[2] == SYSEX_SUB_ID && m[3] == CMD_BRIDGE_REBOOT_BL;
}

/// ダウンロードモードへ落ちるまでの一連の後始末を行うタスク。
///
/// 遅延を挟む必要があるので esp_timer コールバックではなく専用タスクにしている
/// (esp_timer のコールバックは共有タスク上で走るためブロックさせたくない)。
///
/// 手順が重要:
///   1. ACK が実際に送出されるのを待つ (BLE は次の接続イベントを待つ必要がある)
///   2. BLE を明示切断する
///   3. **USB を「リセット後の状態」へ戻してから**手放す (下記)
///   4. ホストが切断を認識する猶予を置く
///   5. FORCE_DOWNLOAD_BOOT を立てて ROM リセット
///
/// USB の扱いには落とし穴がある。何もせずに落とすとホストが古いエンドポイントを
/// 掴んだままになり「列挙はされているのに MIDI に無応答」になることがある
/// (macOS で発生。抜き差しでのみ復旧した)。かといって tud_disconnect() で
/// D+ プルアップを外すだけだと、PHY 設定を手放さないまま落ちる。S3 では
/// その設定が **RTC ドメイン**にあり esp_rom_software_reset_system()
/// (デジタルシステムのみのリセット) でクリアされないため、ROM がバス上に現れない。
///
/// tinyusb_driver_uninstall() は TinyUSB 停止に加えて **USB PHY を削除する**ので、
/// ホストには切断が伝わり、かつ ROM 側が PHY を構成し直せる。加えて PHY の
/// ルーティング選択 (OTG ⇄ USB Serial/JTAG) は IDF 側で戻されないため、
/// ここで明示的にハードウェア制御へ戻す。
static void reboot_bl_task(void *arg) {
    (void)arg;
    vTaskDelay(pdMS_TO_TICKS(300));      // ACK 送出待ち

    if (g_ble_connected && s_conn_handle != BLE_HS_CONN_HANDLE_NONE) {
        ble_gap_terminate(s_conn_handle, BLE_ERR_REM_USER_CONN_TERM);
        vTaskDelay(pdMS_TO_TICKS(100));  // 切断が飛ぶ猶予
    }
#if defined(BOARD_HAS_USB_MIDI)
    usb_midi_bridge_teardown();          // TinyUSB 停止 + USB PHY 削除
    // usb_del_phy() はプル override は戻すが (usb_wrap_hal_phy_disable_pull_override)、
    // PHY のルーティング選択は戻さない (phy_uninstall は USB ペリフェラルを
    // disable するだけ)。S3 では内部 PHY を OTG に繋ぐか USB Serial/JTAG に繋ぐかが
    // RTC ドメインの RTC_CNTL_USB_CONF_REG で決まるので、ハードウェア制御
    // (eFuse/strapping の既定 = ROM が期待する状態) へ戻す。
    REG_CLR_BIT(RTC_CNTL_USB_CONF_REG,
                RTC_CNTL_SW_HW_USB_PHY_SEL | RTC_CNTL_SW_USB_PHY_SEL);
    REG_CLR_BIT(RTC_CNTL_USB_CONF_REG, RTC_CNTL_USB_PAD_ENABLE_OVERRIDE);
    vTaskDelay(pdMS_TO_TICKS(150));      // ホストが切断を処理する猶予
#endif

#if defined(CONFIG_IDF_TARGET_ESP32C6)
    REG_SET_BIT(LP_AON_SYS_CFG_REG, LP_AON_FORCE_DOWNLOAD_BOOT);
#else
    REG_WRITE(RTC_CNTL_OPTION1_REG, RTC_CNTL_FORCE_DOWNLOAD_BOOT);
#endif
    // esp_restart() ではなく ROM の system reset を使う。esp_restart() は
    // ペリフェラル/RTC 周りのリセットを伴い、ROM がブートモードを読む前に
    // FORCE_DOWNLOAD_BOOT が消えてしまう (実機 S3 で確認: コマンドは届いて
    // 再起動もしたが通常モードで復帰した)。
    esp_rom_software_reset_system();
}

/// ACK を返してから後始末タスクを起こす。ACK を送出しきる時間を確保するため
/// 即時には落とさない (とくに BLE は次の接続イベントを待つ必要がある)。
static void handle_bridge_reboot_bl(const uint8_t *m, int n,
                                    void (*send)(const uint8_t *, int)) {
    const uint8_t req_id = (n >= 6) ? m[4] : 0x00;
    const bool ok = (n >= 9) && m[5] == REBOOT_BL_MAGIC0 &&
                    m[6] == REBOOT_BL_MAGIC1 && m[7] == REBOOT_BL_MAGIC2;

