kunichiko/MimicX-firmware/platforms/esp32/main/main.c
    uint8_t ack[8];
    int i = 0;
    ack[i++] = 0xF0;
    ack[i++] = SYSEX_MFR_ID;
    ack[i++] = SYSEX_SUB_ID;
    ack[i++] = CMD_ACK;
    ack[i++] = req_id;
    ack[i++] = ok ? ACK_OK : ACK_INVALID_VALUE;
    ack[i++] = CMD_BRIDGE_REBOOT_BL;
    ack[i++] = 0xF7;
    send(ack, i);

    if (!ok) {
        ESP_LOGW(TAG, "BRIDGE_REBOOT_BOOTLOADER: bad magic -> ignored");
        return;
    }
    ESP_LOGW(TAG, "BRIDGE_REBOOT_BOOTLOADER: entering download mode");
    xTaskCreate(reboot_bl_task, "reboot_bl", 3072, NULL, 5, NULL);
}

static void on_ble_rx(const uint8_t *msg, int len) {
    if (is_bridge_identify_req(msg, len)) {
        ESP_LOGI(TAG, "BRIDGE_IDENTIFY_REQUEST (BLE) -> self-answer");
        send_bridge_identify_response(TRANSPORT_BLE, ble_midi_notify);
        return;
    }
    if (is_bridge_reboot_bl_req(msg, len)) {
        handle_bridge_reboot_bl(msg, len, ble_midi_notify);
        return;
    }
    i2c_bridge_write(msg, len);   // それ以外は CH32 へ中継
}

#if defined(BOARD_HAS_USB_MIDI)
// 中継: PC(USB-MIDI) → CH32(I2C)。BLE と対称。
static void on_usb_rx(const uint8_t *msg, int len) {
    if (is_bridge_identify_req(msg, len)) {
        ESP_LOGI(TAG, "BRIDGE_IDENTIFY_REQUEST (USB) -> self-answer");
        send_bridge_identify_response(TRANSPORT_USB, usb_midi_bridge_notify);
        return;
    }
    if (is_bridge_reboot_bl_req(msg, len)) {
        handle_bridge_reboot_bl(msg, len, usb_midi_bridge_notify);
        return;
    }
    i2c_bridge_write(msg, len);
}
#endif

// ---------------------------------------------------------------------------
// 中継: CH32(I2C+INT) → phone(BLE) / PC(USB)
//   device→host 通知は接続中の全トランスポートへ送る (CH32 の USB+I2C 並走と
//   同じ方針)。未接続側は各 notify 内で捨てられる。
// ---------------------------------------------------------------------------
static void on_i2c_rx(const uint8_t *midi, int len) {
    ble_midi_notify(midi, len);
#if defined(BOARD_HAS_USB_MIDI)
    usb_midi_bridge_notify(midi, len);
#endif
}

// 切断時、CH32 に DISCONNECT + RESET を送って HID を解放させる (押しっぱなし防止)。
// USB/BLE の両トランスポートがある構成では「最後のホストが居なくなったとき」だけ
// 解放する (もう一方がまだ接続中なら送らない)。
static void notify_ch32_disconnect(void) {
    static const uint8_t disc[] = { 0xF0, SYSEX_MFR_ID, SYSEX_SUB_ID, CMD_DISCONNECT, 0x00, 0xF7 };
    static const uint8_t rst[]  = { 0xF0, SYSEX_MFR_ID, SYSEX_SUB_ID, CMD_RESET,      0x00, 0xF7 };
    i2c_bridge_write(disc, sizeof(disc));
    i2c_bridge_write(rst, sizeof(rst));
}

static bool any_other_host_connected_than_ble(void) {
#if defined(BOARD_HAS_USB_MIDI)
    return usb_midi_bridge_mounted();
#else
    return false;
#endif
}

#if defined(BOARD_HAS_USB_MIDI)
// USB マウント状態の変化 (usb_midi_bridge の監視タスクから呼ばれる)。
static void on_usb_state(bool mounted) {
    if (!mounted && !g_ble_connected) {
        notify_ch32_disconnect();
    }
}
#endif

// ---------------------------------------------------------------------------
// 接続パラメータの実測ログ
//
// ble_gap_update_params() は「要求」でしかなく、セントラルが拒否しても
// エラーにはならない。とくに Apple 系ホストはアクセサリ設計ガイドラインの
// 条件 (Interval Min >= 15ms、Interval Max >= Interval Min + 15ms 等) を
// 満たさない要求を **丸ごと拒否** する挙動が知られており、その場合はホストが
// 選んだ既定値 (30ms 前後) のまま据え置かれる。
//
// macOS + BLE アダプタで HEART_BEAT の往復が平均 ~48ms かかっていた
// (USB 経由の同じ ESP32→I2C→CH32 経路は 1.6ms) ため、実際に合意された値を
// 出して確認する。conn_itvl は 1.25ms 単位、supervision_timeout は 10ms 単位。
// ---------------------------------------------------------------------------
static void log_conn_params(uint16_t conn_handle, const char *when) {
    struct ble_gap_conn_desc desc;
    if (ble_gap_conn_find(conn_handle, &desc) != 0) {
        ESP_LOGW(TAG, "conn params (%s): ble_gap_conn_find failed", when);
        return;
    }
    // 1.25ms 単位 → ms を整数演算で (newlib nano だと %f が出ないため)
    unsigned itvl_x100 = (unsigned)desc.conn_itvl * 125u;
    ESP_LOGI(TAG,
             "conn params (%s): itvl=%u (%u.%02u ms) latency=%u timeout=%u (%u ms)",
             when, desc.conn_itvl, itvl_x100 / 100u, itvl_x100 % 100u,
             desc.conn_latency, desc.supervision_timeout,
             (unsigned)desc.supervision_timeout * 10u);
}


// ---------------------------------------------------------------------------
// GAP イベント
// ---------------------------------------------------------------------------
static int gap_event_handler(struct ble_gap_event *event, void *arg) {
    (void)arg;
    switch (event->type) {
        case BLE_GAP_EVENT_CONNECT:
            if (event->connect.status == 0) {
                ESP_LOGI(TAG, "connected; conn_handle=%d", event->connect.conn_handle);
                g_ble_connected = true;
                s_conn_handle = event->connect.conn_handle;
                ble_midi_set_conn(event->connect.conn_handle);
                // 要求前にホストが決めた値を出しておく (比較のため)
                log_conn_params(event->connect.conn_handle, "on connect");
                // レイテンシ低減のため connection interval を 11.25ms へ更新 (§2.3)。
                //
                // macOS 実機での実測経過 (HEART_BEAT RTT のうなり = 1000 mod CI ずつ
                // 位相がずれる現象から CI を逆算した):
                //   要求 7.5-15ms  → CI 30ms のまま (既定値)。下限 7.5ms が Apple の
                //                    許容外でレンジごと拒否されたとみられる
                //   要求 15-30ms   → CI 30ms。レンジ内なので通ったが上限を選ばれた
                //   要求 11.25-15ms→ CI 15ms。RTT 平均 51.7ms → 29.0ms  ← 採用
                //   要求 11.25ms 固定 (min=max) → CI 30ms。レンジを潰すと要求ごと
                //                    拒否される (RTT 平均 46.8ms で 30ms の署名に戻った)
                // macOS は「下限 11.25ms 以上」かつ「レンジに幅があること」を要求し、
                // その上で上限を選ぶ。上限を選ぶ性質を利用して下限に張り付かせようと
                // すると、レンジが潰れた時点で弾かれるので成立しない。
                // よって 11.25-15ms が到達可能な最良値。
                struct ble_gap_upd_params p = {
                    .itvl_min = 9,    // 9 * 1.25ms = 11.25ms
                    .itvl_max = 12,   // 12 * 1.25ms = 15ms
                    .latency  = 0,
                    .supervision_timeout = 400,  // 4s
                };
                int rc = ble_gap_update_params(event->connect.conn_handle, &p);
                ESP_LOGI(TAG, "update_params request (11.25-15ms) rc=%d", rc);
            } else {
                ESP_LOGW(TAG, "connect failed; status=%d", event->connect.status);
                start_advertising();
            }
            return 0;

