kunichiko/MimicX-firmware/platforms/esp32/main/main.c
        case BLE_GAP_EVENT_DISCONNECT:
            ESP_LOGI(TAG, "disconnect; reason=%d", event->disconnect.reason);
            g_ble_connected = false;
            s_conn_handle = BLE_HS_CONN_HANDLE_NONE;
            ble_midi_set_conn(BLE_HS_CONN_HANDLE_NONE);
            if (!any_other_host_connected_than_ble()) {
                notify_ch32_disconnect();   // 最後のホストが消えた → CH32 の HID を解放
            }
            start_advertising();
            return 0;

        case BLE_GAP_EVENT_CONN_UPDATE:
            // 接続パラメータが実際に変わったときに来る (要求が拒否された場合は
            // 来ないか、status != 0 で来る)。合意された値をそのまま出す。
            ESP_LOGI(TAG, "conn update; status=%d", event->conn_update.status);
            log_conn_params(event->conn_update.conn_handle, "after update");
            return 0;

        case BLE_GAP_EVENT_ADV_COMPLETE:
            start_advertising();
            return 0;

        case BLE_GAP_EVENT_SUBSCRIBE:
            ESP_LOGI(TAG, "subscribe; cur_notify=%d", event->subscribe.cur_notify);
            return 0;

        case BLE_GAP_EVENT_MTU:
            ESP_LOGI(TAG, "mtu update; mtu=%d", event->mtu.value);
            return 0;

        case BLE_GAP_EVENT_ENC_CHANGE:
            // ペアリング/暗号化の成立。status==0 で成功。
            ESP_LOGI(TAG, "encryption change; status=%d", event->enc_change.status);
            return 0;

        case BLE_GAP_EVENT_REPEAT_PAIRING: {
            // 相手 (Windows) がボンドを削除して再ペアリングしてきたのに、ESP32 側に
            // 古いボンドが残っているケース。古いボンドを消して再ペアリングを許可する。
            struct ble_gap_conn_desc desc;
            if (ble_gap_conn_find(event->repeat_pairing.conn_handle, &desc) == 0) {
                ble_store_util_delete_peer(&desc.peer_id_addr);
            }
            return BLE_GAP_REPEAT_PAIRING_RETRY;
        }

        case BLE_GAP_EVENT_PASSKEY_ACTION:
            // Just Works では PIN 入力不要。何もしない。
            ESP_LOGI(TAG, "passkey action; action=%d", event->passkey.params.action);
            return 0;

        default:
            return 0;
    }
}

// ---------------------------------------------------------------------------
// アドバタイズ: MIDI サービス UUID を広告し、名前は scan response に載せる
//   (128bit UUID(18B) + flags(3B) で adv が埋まるため名前は分離する)
// ---------------------------------------------------------------------------
// adv_start は接続確立失敗 (BLE_GAP_EVENT_CONNECT status!=0) の直後だと、失敗した
// 接続のスロットがまだ解放されておらず BLE_HS_ENOMEM で失敗することがある
// (MAX_CONNECTIONS=1)。そのまま諦めるとリセットまで誰からも見えなくなるので、
// 失敗時は 500ms 後にリトライする。
static void adv_retry_cb(void *arg) {
    (void)arg;
    start_advertising();
}

static void schedule_adv_retry(void) {
    static esp_timer_handle_t s_adv_retry_timer;
    if (s_adv_retry_timer == NULL) {
        const esp_timer_create_args_t args = {
            .callback = adv_retry_cb,
            .name = "adv_retry",
        };
        if (esp_timer_create(&args, &s_adv_retry_timer) != ESP_OK) return;
    }
    esp_timer_stop(s_adv_retry_timer);
    esp_timer_start_once(s_adv_retry_timer, 500 * 1000);   // 500ms
}

static void start_advertising(void) {
    struct ble_hs_adv_fields fields;
    struct ble_hs_adv_fields rsp_fields;
    struct ble_gap_adv_params adv_params;
    int rc;

    // プライマリ広告に flags + 128bit サービス UUID + デバイス名 を載せる。
    // 名前を scan response だけに置くと、Windows (universal_ble のパッシブスキャン) が
    // 名前を拾えず result.name==null でスキップされ発見できない。31 バイトに収まる
    // (flags 3 + UUID128 18 + name "MimicX" 8 = 29) ので名前もプライマリへ入れる。
    memset(&fields, 0, sizeof(fields));
    fields.flags = BLE_HS_ADV_F_DISC_GEN | BLE_HS_ADV_F_BREDR_UNSUP;
    fields.uuids128 = (ble_uuid128_t *)&ble_midi_svc_uuid;
    fields.num_uuids128 = 1;
    fields.uuids128_is_complete = 1;
    fields.name = (uint8_t *)DEVICE_NAME;
    fields.name_len = strlen(DEVICE_NAME);
    fields.name_is_complete = 1;

    rc = ble_gap_adv_set_fields(&fields);
    if (rc != 0) { ESP_LOGE(TAG, "adv_set_fields rc=%d", rc); return; }

    memset(&rsp_fields, 0, sizeof(rsp_fields));
    rsp_fields.name = (uint8_t *)DEVICE_NAME;
    rsp_fields.name_len = strlen(DEVICE_NAME);
    rsp_fields.name_is_complete = 1;
    rc = ble_gap_adv_rsp_set_fields(&rsp_fields);
    if (rc != 0) { ESP_LOGE(TAG, "adv_rsp_set_fields rc=%d", rc); return; }

    memset(&adv_params, 0, sizeof(adv_params));
    adv_params.conn_mode = BLE_GAP_CONN_MODE_UND;
    adv_params.disc_mode = BLE_GAP_DISC_MODE_GEN;

    rc = ble_gap_adv_start(g_addr_type, NULL, BLE_HS_FOREVER,
                           &adv_params, gap_event_handler, NULL);
    if (rc == BLE_HS_EALREADY) return;   // 既に広告中
    if (rc != 0) {
        ESP_LOGE(TAG, "adv_start rc=%d (retrying in 500ms)", rc);
        schedule_adv_retry();
        return;
    }
    ESP_LOGI(TAG, "advertising as \"%s\"", DEVICE_NAME);
}

// ---------------------------------------------------------------------------
// NimBLE host コールバック
// ---------------------------------------------------------------------------
static void on_sync(void) {
    int rc = ble_hs_util_ensure_addr(0);
    if (rc != 0) { ESP_LOGE(TAG, "ensure_addr rc=%d", rc); return; }
    rc = ble_hs_id_infer_auto(0, &g_addr_type);
    if (rc != 0) { ESP_LOGE(TAG, "infer_auto rc=%d", rc); return; }
    start_advertising();
}

static void on_reset(int reason) {
    ESP_LOGW(TAG, "nimble host reset; reason=%d", reason);
}

static void host_task(void *param) {
    (void)param;
    nimble_port_run();              // ble_hs_shutdown まで戻らない
    nimble_port_freertos_deinit();
}

// ---------------------------------------------------------------------------
// エントリポイント
// ---------------------------------------------------------------------------
void app_main(void) {
    board_early_init();   // アンテナ等のボード固有初期化 (C6)。無線起動より前に行う。

    esp_err_t ret = nvs_flash_init();
    if (ret == ESP_ERR_NVS_NO_FREE_PAGES || ret == ESP_ERR_NVS_NEW_VERSION_FOUND) {
        ESP_ERROR_CHECK(nvs_flash_erase());
        ret = nvs_flash_init();
    }
    ESP_ERROR_CHECK(ret);

    ESP_ERROR_CHECK(nimble_port_init());

    // GATT / GAP サービス初期化
    ble_svc_gap_init();
    ble_svc_gatt_init();

    int rc = ble_midi_register_gatt();
    if (rc != 0) { ESP_LOGE(TAG, "register_gatt rc=%d", rc); return; }

    rc = ble_svc_gap_device_name_set(DEVICE_NAME);
    if (rc != 0) { ESP_LOGE(TAG, "device_name_set rc=%d", rc); }

