kunichiko/MimicX-firmware/platforms/esp32/main/main.c
    ble_hs_cfg.sync_cb  = on_sync;
    ble_hs_cfg.reset_cb = on_reset;

    // BLE ペアリング (Just Works + bonding)。Windows は BLE-MIDI 利用にペアリングを
    // 要求するため必須。iOS/macOS/Android はペアリングせず接続するので影響なし。
    ble_hs_cfg.sm_io_cap = BLE_HS_IO_NO_INPUT_OUTPUT;   // 入出力なし → Just Works
    ble_hs_cfg.sm_bonding = 1;                           // ボンド (鍵を保存)
    ble_hs_cfg.sm_sc = 1;                                // LE Secure Connections
    ble_hs_cfg.sm_our_key_dist  = BLE_SM_PAIR_KEY_DIST_ENC | BLE_SM_PAIR_KEY_DIST_ID;
    ble_hs_cfg.sm_their_key_dist = BLE_SM_PAIR_KEY_DIST_ENC | BLE_SM_PAIR_KEY_DIST_ID;
    ble_store_config_init();                             // ボンドを NVS に永続化

    // I2C ブリッジ (CH32 デバイスエンジンへの橋渡し) を起動。
    // BT コントローラの割り込み確保と競合しないよう NimBLE 初期化の後に行う。
    i2c_bridge_init(on_i2c_rx);

    // 起動時 CH32 ファーム自動更新: 内蔵イメージが新しければ SWD で書き換える。
    // (更新時は内部で I2C ブリッジを再 init して戻る)
    ch32_ota_check_and_update(on_i2c_rx);

    // BLE 受信 → 中継ハンドラを登録 (i2c_bridge_init 完了後)。
    ble_midi_set_rx_handler(on_ble_rx);

#if defined(BOARD_HAS_USB_MIDI)
    // USB-MIDI トランスポート (S3 のみ)。BLE と併走し、同じ CH32 へ中継する。
    usb_midi_bridge_init(on_usb_rx, on_usb_state);
#endif

    char ser[16];
    build_serial16(ser);
    ESP_LOGI(TAG, "MimicX-ESP32 bridge proto %d.%d fw %d.%d.%d serial=%.16s",
             BRIDGE_PROTO_MAJOR, BRIDGE_PROTO_MINOR,
             BRIDGE_FW_MAJOR, BRIDGE_FW_MINOR, BRIDGE_FW_PATCH, ser);

    nimble_port_freertos_init(host_task);
    ESP_LOGI(TAG, "MimicX-ESP32 BLE-MIDI <-> I2C bridge started");
}
